#შექენით სეტები და განიხილეთ ოპერატორები (union,intersection,difference,symmetric_difference,clear,add,remove) 
# ახსენით ასევე კომენტარებით და გააკეთეთ ორივე ხერხით როგორც ტექსტიტ ისე სიმბოლოთი. 


x = {"Apple", "Banana", "Mangosteen", "Pear"}
y = {"Apple", "Pear", "Peach", "Orange"}

print(x.union(y)) #გაერთიანება-ორივე სეტის ელემენტებს აერთიანებს. თუ 2 ერთნარი იქნება მარტო 1-ს დატოვებს და მეორეს არ გაიმეორებს
print(x | y)

print(x.intersection(y)) #გადაკვეთა-ნახულობს 2 სეტის საერთოს და მხოლოდ მაგი ელემენტები გამოაქვს.
print(x & y)

print(x.difference(y)) #განსხვავება-მხოლოდ ისეთ ელემენტებს ბეჭდავს რომლებიც არიან პირველ სეტში, მაგრამ არ არის მეორეში
print(x - y)

print(x.symmetric_difference(y)) #სიმეტრიული განსხვავება-ბეჭდავს ყველა ელემენტს, გარდა იმათ, რომელიც ორივე სეტშია
print(x ^ y)

x.clear() #გასუფთავება/გაცარიელება-აცარიელებს სეტს

x.add("Papaya") #დამატება-უმატებს ელემენტს სეტს
print(x)

x.remove("Papaya") #მოშორება-აშორებს არსებულ ელემენტს სეტიდან