#შექმენი სეტი fruit1 და fruit2 შეინახეტ სხვადასხვა ხილები და გააკეთეთ ყველა მანიპულაცია რაც გახსენდებათ ოპერატორების დახმარებით, 
# შემდეგ ახხსენით კომენტარებით.

fruit1 = {"Apple", "Banana", "Mangosteen", "Pear"}
fruit2 = {"Apple", "Pear", "Peach", "Orange"}

#გაერთიანება-ორივე სეტის ელემენტებს აერთიანებს. თუ 2 ერთნარი იქნება მარტო 1-ს დატოვებს და მეორეს არ გაიმეორებს
print(fruit1 | fruit2)

#გადაკვეთა-ნახულობს 2 სეტის საერთოს და მხოლოდ მაგი ელემენტები გამოაქვს.
print(fruit1 & fruit2)

#განსხვავება-მხოლოდ ისეთ ელემენტებს ბეჭდავს რომლებიც არიან პირველ სეტში, მაგრამ არ არის მეორეში
print(fruit1 - fruit2)

#სიმეტრიული განსხვავება-ბეჭდავს ყველა ელემენტს, გარდა იმათ, რომელიც ორივე სეტშია
print(fruit1 ^ fruit2)

#გასუფთავება/გაცარიელება-აცარიელებს სეტს
fruit1.clear() 

#დამატება-უმატებს ელემენტს სეტს
fruit1.add("Papaya") 
print(fruit1)

#მოშორება-აშორებს არსებულ ელემენტს სეტიდან
fruit1.remove("Papaya")  