#კომენტარის სახით ჩამოთვალე ჩაშენებული ფუნქციები და რას შვება თითეული ახსენი

print() #ბეჭდავს ფრჩხილებში ჩაწერილ ინფორმაციას ტერმინალში
input() #ინპუტის მეშვეობით დეველოპერი ადძლევს მომხმარებელს საშუალებას, რომ სისტემაში მასზე საჭირო ინფორმაცია ჩაწეროს(მაგ: კოთხვაზე პასუხი)
len() #თვლის სტრინგის/ლისტის ასოების/ელემენტების რაოდენობას
range() #ქმნის რიცხვებს და for ლუპისთვის გამოიყენება (მაგ: for i in range(5):  print(i) დაბეჭდავს 0,1,2,3,4)
list() #ქმნის ლისტს, არის ცვლადივით, მაგრამ ინახავს მეტ ელემენტს და განსხვავებული სტრუქტურა აქვს
str() #გარდაქმნის ფრჩხილებში მყოფ ინფორმაციის ტიპს სტრინგად, ხშირად გარდაქმნის integer-ს და float-ს
int() #გარდაქმნის ფრჩხილებში მყოფ ინფორმაციის ტიპს ინტეჯერად, მუშაობს თუ რიცხვი სტრინგის სახით არის გარდაქმნილი(მაგ ინპუტში ჩაწერილი პასუხი ავტომატიურად სტრინგი ხდება, მიუხედავად იმისა თუ რიცხვია ჩაწერილი)
float() #გარდაქმნის ფრჩხილებში მყოფ ინფორმაციის ტიპს ფლოატად, გარდაქმნის ინტეჯერს და უმატებს .0-ს

                                                                     