'''
დავალება 1: წნევის ანალიზი
მომხმარებელი შეიყვანს ორ მაჩვენებელს: სისტოლური და დიასტოლური წნევა.
პროგრამამ უნდა განსაზღვროს წნევის კატეგორია:

თუ სისტოლური > 140 ან დიასტოლური > 90 → "მაღალი წნევა"

თუ სისტოლური < 90 ან დიასტოლური < 60 → "დაბალი წნევა"

სხვა შემთხვევაში → "წნევა ნორმალურია"
'''

x=int(input("შეიყვანეთ თქვენი სისტოლური წნევა: "))
y=int(input("შეიყვანეთ თქვენი დიასტოლური წნევა: "))

if x >= 140 or y >= 90:
    print("მაღალი წნევა")
elif x <= 90 or y <= 60:
    print("დაბალი წნევა")
else:
    print("წნევა ნორმალურია")