'''
ფიზიკური აქტივობის რეკომენდაცია
მომხმარებელი შეიყვანს თავის ასაკს და გულის ცემას.
პროგრამამ უნდა დაარიგოს ასეთი რჩევები:

ასაკი < 30 და გულისცემა < 140 → "შეგიძლიათ მეტი ივარჯიშოთ"

ასაკი ≥ 30 და გულისცემა > 170 → "დასვენება გჭირდებათ"

სხვა შემთხვევაში → "აქტივობის დონე ნორმალურია"
'''

age = int(input("შეიყვანეთ თქვენი ასაკი: "))
bpm = int(input("შეიყვანეთ თქვენი გულის ცემა: "))

if age < 30 and bpm < 140:
    print("შეგიძლიათ მეტი ივარჯიშოთ")
elif age >= 30 and bpm > 170:
    print("დასვენება გჭირდებათ")
else:
    print("აქტივობის დონე ნორმალურია")