'''შექმენი პროგრამა, რომელიც მომხმარებლის მიერ შეყვანილი ასაკის მიხედვით დაადგენს, რომელი ასაკობრივი ჯგუფის წევრია ადამიანი.
თუ ასაკი უარყოფითია — გამოიტანე: "არასწორი ასაკი"
თუ ასაკი ნაკლებია 13-ზე — გამოიტანე: "ბავშვი"
თუ ასაკი არის 13-დან 19-ის ჩათვლით — გამოიტანე: "თინეიჯერი"
თუ ასაკი არის 20-დან 59-ის ჩათვლით — გამოიტანე: "ზრდასრული"
თუ ასაკი არის 60 ან მეტი — გამოიტანე: "პენსიონერი"'''

x=int(input("შეიყვანეთ თქვენი ასაკი: "))

if x < 0:
    print("არასწორი ასაკი")
elif x <=13:
    print("ბავშვი")
elif x <= 19:
    print("თინეიჯერი")
elif x <= 59:
    print("ზრდასრული")
else:
    print("პენსიონერი")