# შეიყვანე 5 სიტყვა, მაგრამ შეინახე (დაახსოვრე) მხოლოდ ისინი, რომლებიც სწორია.
#  რა არის „სწორი“ სიტყვა?
# ამაში უნდა გითხრან წინასწარ რა კრიტერიუმით აირჩიე სწორი, მაგრამ დავუშვათ, სიტყვა სწორია მაშინ, როცა მასში ორივე — პირველი და ბოლო ასოები — თანხმოვნებია.

# შენ უნდა უთხრა 5 სიტყვა. რობოტი კი შეინახავს მხოლოდ იმ სიტყვებს, რომლებიც სწორია.

#სწორი სიტყვაა ის, რომელსაც შიგნით ასოები: ა, ს, ან დ გააჩნია

a = input("შეიყვანე სიტყვა: ")
b = input("შეიყვანე სიტყვა: ")
c = input("შეიყვანე სიტყვა: ")
d = input("შეიყვანე სიტყვა: ")
e = input("შეიყვანე სიტყვა: ")

if "ა" in a or "ს" in a or "დ" in a:
    print(a)
if "ა" in b or "ს" in b or "დ" in b:
    print(b)
if "ა" in c or "ს" in c or "დ" in c:
    print(c)
if "ა" in d or "ს" in d or "დ" in d:
    print(d)
if "ა" in e or "ს" in e or "დ" in e:
    print(e)