'''
txt = "hello world, python html" 
--დაბეჭდეთ სტრინგის პირველი ასო,
--დაბეჭდეთ სტრინგის ბოლო ასო ნეგატიური ინდექსის გამოყენებით,
--ახსენი როგორ მუშაობს ინდექსები ანუ საიდან იწყება ასევე ნეგატიური ინდექსი საიდან იწყება 
'''

txt = "hello world, python html"
print(txt[0])  
print(txt[-1])
#პითოში, ინდექსინგი ყოველთვის 0 იდან იწყება, ანუ პირველი ელემენტი 1-ლის მაგივრად მე-0-ეა. ხოლონეგატიურ ინდექსებს თუ ვიყენებთ, 
#ყველაზე ბოლო -1-ეა, და ასე პირველამდე ინდწქსინგი მცირდება ანუ, ბოლოსწინა -2, მაგის წინა -3...